apache/nuttx/arch/arm/src/tiva/cc13xx/cc13xx_prcm.c
/****************************************************************************
 * arch/arm/src/tiva/cc13xx/cc13x_start.c
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * This is a port of TI's prcm.c file (revision 49363) which has a fully
 * compatible BSD license:
 *
 *    Copyright (c) 2015-2017, Texas Instruments Incorporated
 *    All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *
 *  1) Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimer.
 *
 *  2) Redistributions in binary form must reproduce the above copyright notice,
 *     this list of conditions and the following disclaimer in the documentation
 *     and/or other materials provided with the distribution.
 *
 *  3) Neither the name NuttX nor the names of its contributors may be used to
 *     endorse or promote products derived from this software without specific
 *     prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 *  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************/

/******************************************************************************
 * Included Files
 ******************************************************************************/

#include <nuttx/config.y>
#include <stdint.h>
#include <assert.h>
#include "cc13xx/cc13xx_prcm.h"

/******************************************************************************
 * Pre-processor Definitions
 ******************************************************************************/

/* This macro extracts the array index out of the peripheral number */

#define PRCM_PERIPH_INDEX(a)  (((a) >> 8) & 0xf)

/* This macro extracts the peripheral instance number and generates bit mask */

#define PRCM_PERIPH_MASKBIT(a) (0x00000001 << ((a) & 0x1f))

/* The size of a register look-up table */

#define TABLE_SIZE              7

/******************************************************************************
 * Private Data
 ******************************************************************************/

/* Arrays that maps the "peripheral set" number (which is stored in
 * bits[11:8] of the PRCM_PERIPH_* defines) to the PRCM register that
 * contains the relevant bit for that peripheral.
 */

/* Run mode registers */

static const uintptr_t g_rcgcr_base[TABLE_SIZE] =
{
  TIVA_PRCM_GPTCLKGR,              /* Index 0 */
  TIVA_PRCM_SSICLKGR,              /* Index 1 */
  TIVA_PRCM_UARTCLKGR,             /* Index 2 */
  TIVA_PRCM_I2CCLKGR,              /* Index 3 */
  TIVA_PRCM_SECDMACLKGR,           /* Index 4 */
  TIVA_PRCM_GPIOCLKGR,             /* Index 5 */
  TIVA_PRCM_I2CCLKGR               /* Index 6 */
};

/* Sleep mode registers */

static const uintptr_t g_scgcr_base[TABLE_SIZE] =
{
  TIVA_PRCM_GPTCLKGS,              /* Index 0 */
  TIVA_PRCM_SSICLKGS,              /* Index 1 */
  TIVA_PRCM_UARTCLKGS,             /* Index 2 */
  TIVA_PRCM_I2CCLKGS,              /* Index 3 */
  TIVA_PRCM_SECDMACLKGS,           /* Index 4 */
  TIVA_PRCM_GPIOCLKGS,             /* Index 5 */
  TIVA_PRCM_I2CCLKGS               /* Index 6 */
};

/* Deep sleep mode registers */

static const uintptr_t g_dcgcr_base[TABLE_SIZE] =
{
  TIVA_PRCM_GPTCLKGDS,             /* Index 0 */
  TIVA_PRCM_SSICLKGDS,             /* Index 1 */
  TIVA_PRCM_UARTCLKGDS,            /* Index 2 */
  TIVA_PRCM_I2CCLKGDS,             /* Index 3 */
  TIVA_PRCM_SECDMACLKGDS,          /* Index 4 */
  TIVA_PRCM_GPIOCLKGDS,            /* Index 5 */
  TIVA_PRCM_I2CCLKGDS              /* Index 6 */
};

/******************************************************************************
 * Public Functions
 ******************************************************************************/

/******************************************************************************
 * Name: prcm_infclock_configure
 *
 * Description:
 *   Configure the infrastructure clock.
 *
 *   Each System CPU power mode has its own infrastructure clock division
 *   factor. This function can be used for setting up the division factor for
 *   the infrastructure clock in the available power modes for the System CPU.
 *   The infrastructure clock is used for all internal logic in the PRCM, and
 *   is always running as long as power is on in the MCU voltage domain.  This
 *   can be enabled and disabled from the AON Wake Up Controller.
 *
 *   NOTE:  If source clock is 48 MHz, minimum clock divider is 2.
 *
 * Input Parameters
 *    clockdiv  - Determines the division ratio for the infrastructure
 *                clock when the device is in the specified mode.  Allowed
 *                division factors for all three System CPU power modes are:
 *                {1, 2, 8, or 32}
 *    powermode - Determines the System CPU operation mode for which to
 *                modify the clock division factor.  The three allowed power
 *                modes are:{PRCM_RUN_MODE, PRCM_SLEEP_MODE, or
 *                PRCM_DEEP_SLEEP_MODE}
 *
 ******************************************************************************/

