apache/nuttx/arch/arm/src/tiva/cc13xx/cc13xx_prcm.c
void prcm_infclock_configure(enum prcm_clkdivider_e clkdiv,
                             enum prcm_powermode_e powermode)
{
  uint32_t divisor;

  /* Find the correct division factor. */

  divisor = 0;
  if (clkdiv == PRCM_CLOCK_DIV_1)
    {
      divisor = PRCM_INFRCLKDIVR_RATIO_DIV1;
    }
  else if (clkdiv == PRCM_CLOCK_DIV_2)
    {
      divisor = PRCM_INFRCLKDIVR_RATIO_DIV2;
    }
  else if (clkdiv == PRCM_CLOCK_DIV_8)
    {
      divisor = PRCM_INFRCLKDIVR_RATIO_DIV8;
    }
  else if (clkdiv == PRCM_CLOCK_DIV_32)
    {
      divisor = PRCM_INFRCLKDIVR_RATIO_DIV32;
    }
  else
    {
      DEBUGPANIC();
    }

  /* Determine the correct power mode set the division factor accordingly. */

  if (powermode == PRCM_RUN_MODE)
    {
      putreg32(divisor, TIVA_PRCM_INFRCLKDIVR);
    }
  else if (powermode == PRCM_SLEEP_MODE)
    {
      putreg32(divisor, TIVA_PRCM_INFRCLKDIVS);
    }
  else if (powermode == PRCM_DEEP_SLEEP_MODE)
    {
      putreg32(divisor, TIVA_PRCM_INFRCLKDIVDSS);
    }
  else
    {
      DEBUGPANIC();
    }
}

/******************************************************************************
 * Name: prcm_audioclock_manual
 *
 * Description:
 *   Configure the audio clock generation with manual setting of clock divider.
 *
 *   NOTE: See hardware documentation before setting audio clock dividers manually.
 *
 * Input Parameters:
 *   clkconfig - The audio clock configuration.  The parameter is a bitwise
 *               OR'ed value consisting of:
 *
 *               1) Phase: PRCM_I2SCLKCTL_WCLKPHASE_SINGLE or
 *                  PRCM_I2SCLKCTL_WCLKPHASE_DUAL and
 *               2) Clock polarity:  PRCM_I2SCLKCTL_POSEDGE or
 *                  PRCM_I2SCLKCTL_NEGEDGE
 *
 *   mstdiv    - The desired master clock divider.
 *   worddiv   - The desired word clock divider.
 *   bitdiv    - The desired bit clock divider.
 *
 ******************************************************************************/

#ifdef CONFIG_TIVA_I2S
void prcm_audioclock_manual(uint32_t clkconfig, uint32_t mstdiv,
                            uint32_t bitdiv, uint32_t worddiv)
{
  uint32_t regval;

  DEBUGASSERT(clkconfig & ~(PRCM_I2SCLKCTL_WCLKPHASE_MASK |
                            PRCM_I2SCLKCTL_POSEDGE) == 0);

  /* Make sure the audio clock generation is disabled before reconfiguring. */

  prcm_audioclock_disable();

  /* Make sure to compensate the Frame clock division factor if using single
   * phase format. */

  if ((clkconfig & PRCM_I2SCLKCTL_WCLKPHASE_MASK) ==
      PRCM_I2SCLKCTL_WCLKPHASE_SINGLE)
    {
      worddiv -= 1;
    }

  /* Write the clock division factors. */

  putreg32(mstdiv, TIVA_PRCM_I2SMCLKDIV);
  putreg32(bitdiv, TIVA_PRCM_I2SBCLKDIV);
  putreg32(worddiv, TIVA_PRCM_I2SWCLKDIV);

  /* Configure the Word clock format and polarity. */

  regval  = getreg32(TIVA_PRCM_I2SCLKCTL);
  retval &= ~(PRCM_I2SCLKCTL_WCLKPHASE_MASK | PRCM_I2SCLKCTL_POSEDGE);
  putreg32(regval | clkconfig, TIVA_PRCM_I2SCLKCTL);
}

/******************************************************************************
 * Name: prcm_audioclock_configure
 *
 * Description:
 *   Configure the audio clock generation
 *
 *   Use this function to set the sample rate when using internal audio clock
 *   generation for the I2S module.
 *
 *   NOTE:  While other clocks are possible, the stability of the four sample
 *   rates defined here are only guaranteed if the clock input to the I2S module
 *   is 48MHz.
 *
 * Input Parameters:
 *   clkconfig - The audio clock configuration.  The parameter is a bitwise
 *               OR'ed value consisting of:
 *
 *               1) Phase: PRCM_I2SCLKCTL_WCLKPHASE_SINGLE or
 *                  PRCM_I2SCLKCTL_WCLKPHASE_DUAL and
 *               2) Clock polarity:  PRCM_I2SCLKCTL_POSEDGE or
 *                  PRCM_I2SCLKCTL_NEGEDGE
 *
 *   samplerate - The desired audio clock sample rate.  The supported sample
 *                rate configurations are: {I2S_SAMPLE_RATE_16K,
 *                I2S_SAMPLE_RATE_24K, I2S_SAMPLE_RATE_32K, or
 *                I2S_SAMPLE_RATE_48K}
 *
 ******************************************************************************/

#ifdef CONFIG_TIVA_I2S
void prcm_audioclock_configure(uint32_t clkconfig,
                               enum prcm_i2samplerate_e samplerate)
{
  uint32_t mstdiv;
  uint32_t bitdiv;
  uint32_t worddiv;

  DEBUGASSERT(samplerate == I2S_SAMPLE_RATE_16K ||
              samplerate == I2S_SAMPLE_RATE_24K ||
              samplerate == I2S_SAMPLE_RATE_32K ||
              samplerate == I2S_SAMPLE_RATE_48K);

  mstdiv  = 0;
  bitdiv  = 0;
  worddiv = 0;

  /* Define the clock division factors for the audio interface. */

  switch (samplerate)
    {
    case I2S_SAMPLE_RATE_16K:
      mstdiv  = 6;
      bitdiv  = 60;
      worddiv = 25;
      break;

    case I2S_SAMPLE_RATE_24K:
      mstdiv  = 4;
      bitdiv  = 40;
      worddiv = 25;
      break;

    case I2S_SAMPLE_RATE_32K:
      mstdiv  = 3;
      bitdiv  = 30;
      worddiv = 25;
      break;

    case I2S_SAMPLE_RATE_48K:
      mstdiv  = 2;
      bitdiv  = 20;
      worddiv = 25;
      break;
    }

  prcm_audioclock_manual(clkconfig, mstdiv, bitdiv, worddiv);
}
#endif

/******************************************************************************
 * Name: prcm_powerdomain_on
 *
 * Description:
 *   Turn power on in power domains in the MCU domain
 *   Use this function to turn on power domains inside the MCU voltage domain.
 *
 *   Power on and power off request has different implications for the
 *   different power domains.
 *   - RF Core power domain:
 *     - Power On  : Domain is on or in the process of turning on.
 *     - Power Off : Domain is powered down when System CPU is in deep sleep.
 *                   The third option for the RF Core is to power down when
 *                   the it is idle.  prcm_rfpowerdown_whenidle()
 *   - SERIAL power domain:
 *     - Power on  : Domain is powered on.
 *     - Power off : Domain is powered off.
 *   - PERIPHERIAL power domain:
 *     - Power on  : Domain is powered on.
 *     - Power off : Domain is powered off.
 *   - VIMS power domain:
 *     - Power On  : Domain is powered if Bus domain is powered.
 *     - Power Off : Domain is only powered when CPU domain is on.
 *   - BUS power domain:
 *     - Power On  : Domain is on.
 *     - Power Off : Domain is on if requested by RF Core or if CPU domain
 *                   is on.
 *   - CPU power domain:
 *     - Power On  : Domain is on.
 *     - Power Off : Domain is powering down if System CPU is idle. This
 *                   will also initiate a power down of the SRAM and BUS
 *                   power domains, unless RF Core is requesting them to
 *                   be on.
 *
 *   NOTE:  After a call to this function the status of the power domain
 *   should be checked using either prcm_powerdomain_status().
 *   Any write operation to a power domain which is still not operational can
 *   result in unexpected behavior.
 *
 * Input Parameters
 *   domains - Determines which power domains to turn on.  The domains that
 *             can be turned on/off are:
 *             1) PRCM_DOMAIN_RFCORE : RF Core
 *             2) PRCM_DOMAIN_SERIAL : SSI0, UART0, I2C0
 *             3) PRCM_DOMAIN_PERIPH : GPT0, GPT1, GPT2, GPT3, GPIO, SSI1,
 *                                     I2S, DMA, UART1
 *             4) PRCM_DOMAIN_VIMS   : SRAM, FLASH, ROM
 *             5) PRCM_DOMAIN_SYSBUS
 *             6) PRCM_DOMAIN_CPU
 *
 ******************************************************************************/

void prcm_powerdomain_on(uint32_t domains)
{
  /* Check the arguments. */

  DEBUGASSERT((domains & PRCM_DOMAIN_RFCORE) != 0 ||
         (domains & PRCM_DOMAIN_SERIAL) != 0 ||
         (domains & PRCM_DOMAIN_PERIPH) != 0 ||
         (domains & PRCM_DOMAIN_CPU)    != 0 ||
         (domains & PRCM_DOMAIN_VIMS)   != 0);

