apache/nuttx/arch/arm/src/tiva/cc13xx/cc13xx_prcm.c
  /* Assert the request to power on the right domains. */

  if ((domains & PRCM_DOMAIN_RFCORE) != 0)
    {
      putreg32(PRCM_PDCTL0RFC_ON, TIVA_PRCM_PDCTL0RFC);

#ifdef CONFIG_ARCH_CHIP_CC13X0
      /* The PDCTL1RFC access is meant to "be used by RFC in autonomous mode",
       * but keeping it for compatibility on already ROM'ed products (since
       * this is a ROM function). RFC power domain is on if (PRCM_O_PDCTL0RFC
       * || PRCM_O_PDCTL1RFC).
       */

      putreg32(PRCM_PDCTL1RFC_ON, TIVA_PRCM_PDCTL1RFC);
#endif
    }

  if ((domains & PRCM_DOMAIN_SERIAL) != 0)
    {
      putreg32(PRCM_PDCTL0SERIAL_ON, TIVA_PRCM_PDCTL0SERIAL);
    }

  if ((domains & PRCM_DOMAIN_PERIPH) != 0)
    {
      putreg32(PRCM_PDCTL0PERIPH_ON, TIVA_PRCM_PDCTL0PERIPH);
    }

  if ((domains & PRCM_DOMAIN_VIMS) != 0)
    {
      putreg32(PRCM_PDCTL1VIMS_ON, TIVA_PRCM_PDCTL1VIMS);
    }

  if ((domains & PRCM_DOMAIN_CPU) != 0)
    {
      putreg32(PRCM_PDCTL1CPU_ON, TIVA_PRCM_PDCTL1CPU);
    }
}

/******************************************************************************
 * Name: prcm_powerdomain_off
 *
 * Description:
 *   Turn off a specific power domain
 *   Use this function to power down domains inside the MCU voltage domain.
 *
 *   NOTE:  See prcm_powerdomain_on() for specifics regarding on/off
 *   configuration.
 *
 * Input Parameters
 *   domains - Determines which power domains to turn off.  The domains that
 *             can be turned on/off are:
 *             1) PRCM_DOMAIN_RFCORE : RF Core
 *             2) PRCM_DOMAIN_SERIAL : SSI0, UART0, I2C0
 *             3) PRCM_DOMAIN_PERIPH : GPT0, GPT1, GPT2, GPT3, GPIO, SSI1,
 *                                     I2S, DMA, UART1
 *             4) PRCM_DOMAIN_VIMS   : SRAM, FLASH, ROM
 *             5) PRCM_DOMAIN_SYSBUS
 *             6) PRCM_DOMAIN_CPU
 *
 ******************************************************************************/

void prcm_powerdomain_off(uint32_t domains)
{
  /* Check the arguments. */

  DEBUGASSERT((domains & PRCM_DOMAIN_RFCORE) != 0 ||
              (domains & PRCM_DOMAIN_SERIAL) != 0 ||
              (domains & PRCM_DOMAIN_PERIPH) != 0 ||
              (domains & PRCM_DOMAIN_CPU)    != 0 ||
              (domains & PRCM_DOMAIN_VIMS)   != 0);

  /* Assert the request to power off the right domains. */

  if (domains & PRCM_DOMAIN_RFCORE)
    {
      putreg32(0, TIVA_PRCM_PDCTL0RFC);

#ifdef CONFIG_ARCH_CHIP_CC13X0
      /* The PDCTL1RFC access is meant to "be used by RFC in autonomous mode",
       * but keeping it for compatibility on already ROM'ed products (since
       * this is a ROM function). RFC power domain is on if (PRCM_O_PDCTL0RFC
       * || PRCM_O_PDCTL1RFC).
       */

      putreg32(0, TIVA_PRCM_PDCTL1RFC);
#endif
    }

  if (domains & PRCM_DOMAIN_SERIAL)
    {
      putreg32(0, TIVA_PRCM_PDCTL0SERIAL);
    }

  if (domains & PRCM_DOMAIN_PERIPH)
    {
      putreg32(0, TIVA_PRCM_PDCTL0PERIPH);
    }

  if (domains & PRCM_DOMAIN_VIMS)
    {
#ifdef CONFIG_ARCH_CHIP_CC13X0
      putreg32(0, TIVA_PRCM_PDCTL1VIMS);
#else
      /* Write bits domains[17:16] to the VIMS_MODE alias register.
       * PRCM_DOMAIN_VIMS sets VIMS_MODE=0b00, PRCM_DOMAIN_VIMS_OFF_NO_WAKEUP
       * sets VIMS_MODE=0b10.
       */

      DEBUGASSERT((domains & 0x00010000) == 0);
      putreg32((domains >> 16) & 3, TIVA_PRCM_PDCTL1VIMS);
#endif
    }

  if (domains & PRCM_DOMAIN_CPU)
    {
      putreg32(0, TIVA_PRCM_PDCTL1CPU);
    }
}

/******************************************************************************
 * Name: prcm_periph_rundisable
 *
 * Description:
 *   Enables a peripheral in Run mode
 *
 *   Peripherals are enabled with this function.  At power-up, some peripherals
 *   are disabled; they must be enabled in order to operate or respond to
 *   register reads/writes.
 *
 *   NOTE:  The actual enabling of the peripheral may be delayed until some
 *   time after this function returns. Care should be taken to ensure that the
 *   peripheral is not accessed until it is enabled.
 *
 *   When enabling Timers always make sure that the division factor for the
 *   PERBUSCPUCLK is set. This will guarantee that the timers run at a
 *   continuous rate even if the SYSBUSCLK is gated.
 *
 *   NOTE: A call to this function will only setup the shadow registers in the
 *   MCU domain for the PRCM module. For the changes to propagate to the
 *   system controller in the AON domain a call to this function should always
 *   be followed by a call to prcm_load_set().
 *
 * Input Parameters:
 *   peripheral - The peripheral to enable. This is an encoded value.  See the
 *                PRCRM_PERIPH_* definitions for available encodings.
 *
 ******************************************************************************/

void prcm_periph_runenable(uint32_t peripheral)
{
  unsigned int index;

  /* Extract the index */

  index = PRCM_PERIPH_INDEX(peripheral);
  DEBUGASSERT(index < TABLE_SIZE);

  /* Enable module in Run Mode. */

  modifyreg32(g_rcgcr_base[index], PRCM_PERIPH_MASKBIT(peripheral), 0);
}

/******************************************************************************
 * Name: prcm_periph_rundisable
 *
 * Description:
 *   Disables a peripheral in Run mode
 *
 *   Peripherals are disabled with this function. Once disabled, they will not
 *   operate or respond to register reads/writes.
 *
 *   NOTE: A call to this function will only setup the shadow registers in the
 *   MCU domain for the PRCM module. For the changes to propagate to the system
 *   controller in the AON domain a call to this function should always be
 *   followed by a call to prcm_load_set().
 *
 *   NOTE: The actual disabling of the peripheral may be delayed until some
 *   time after this function returns. Care should be taken by the user to
 *   ensure that the peripheral is not accessed in this interval as this might
 *   cause the system to hang.
 *
 * Input Parameters:
 *   peripheral - The peripheral to disable. This is an encoded value.  See the
 *                PRCRM_PERIPH_* definitions for available encodings.
 *
 ******************************************************************************/

void prcm_periph_rundisable(uint32_t peripheral)
{
  unsigned int index;

  /* Extract the index */

  index = PRCM_PERIPH_INDEX(peripheral);
  DEBUGASSERT(index < TABLE_SIZE);

  /* Disable module in Run Mode. */

  modifyreg32(g_rcgcr_base[index], 0, PRCM_PERIPH_MASKBIT(peripheral));
}

