apache/nuttx/arch/arm/src/tiva/cc13xx/cc13xx_prcm.c
/******************************************************************************
 * Name: prcm_periph_sleepenable
 *
 * Description:
 *   Enables a peripheral in sleep mode
 *
 *   This function allows a peripheral to continue operating when the processor
 *   goes into sleep mode. Since the clocking configuration of the device does
 *   not change, any peripheral can safely continue operating while the
 *   processor is in sleep mode, and can therefore wake the processor from sleep
 *   mode.
 *
 *   NOTE: A call to this function will only setup the shadow registers in the
 *   MCU domain for the PRCM module. For the changes to propagate to the system
 *   controller in the AON domain a call to this function should always be
 *   followed by a call to prcm_load_set().
 *
 * Input Parameters:
 *   peripheral - The peripheral to enable in sleep mode. This is an encoded
 *                value.  See the PRCRM_PERIPH_* definitions for available
 *                encodings.
 *
 ******************************************************************************/

void prcm_periph_sleepenable(uint32_t peripheral)
{
  unsigned int index;

  /* Extract the index */

  index = PRCM_PERIPH_INDEX(peripheral);
  DEBUGASSERT(index < TABLE_SIZE);

  /* Enable this peripheral in sleep mode. */

  modifyreg32(g_scgcr_base[index], PRCM_PERIPH_MASKBIT(peripheral), 0);
}

/******************************************************************************
 * Name: prcm_periph_sleepdisable
 *
 * Description:
 *   Disables a peripheral in sleep mode
 *
 *   This function causes a peripheral to stop operating when the processor goes
 *   into sleep mode. Disabling peripherals while in sleep mode helps to lower
 *   the current draw of the device. If enabled (via prcm_periph_runenable()),
 *   the peripheral will automatically resume operation when the processor
 *   leaves sleep mode, maintaining its entire state from before sleep mode was
 *   entered.
 *
 *   NOTE: A call to this function will only setup the shadow registers in the
 *   MCU domain for the PRCM module. For the changes to propagate to the system
 *   controller in the AON domain a call to this function should always be
 *   followed by a call to prcm_load_set().
 *
 * Input Parameters:
 *   peripheral - The peripheral to disable in sleep mode. This is an encoded
 *                value.  See the PRCRM_PERIPH_* definitions for available
 *                encodings.
 *
 ******************************************************************************/

void prcm_periph_sleepdisable(uint32_t peripheral)
{
  unsigned int index;

  /* Extract the index */

  index = PRCM_PERIPH_INDEX(peripheral);
  DEBUGASSERT(index < TABLE_SIZE);

  /* Disable this peripheral in sleep mode */

  modifyreg32(g_scgcr_base[index], 0, PRCM_PERIPH_MASKBIT(peripheral));
}

/******************************************************************************
 * Name: prcm_periph_deepsleepenable
 *
 * Description:
 *   Enables a peripheral in deep-sleep mode
 *
 *   This function allows a peripheral to continue operating when the processor
 *   goes into deep-sleep mode.  Since the clocking configuration of the device
 *   may change, not all peripherals can safely continue operating while the
 *   processor is in sleep mode. This in turn depends on the chosen power mode.
 *   It is the responsibility of the caller to make sensible choices.
 *
 *   NOTE: A call to this function will only setup the shadow registers in the
 *   MCU domain for the PRCM module. For the changes to propagate to the system
 *   controller in the AON domain a call to this function should always be
 *   followed by a call to prcm_load_set().
 *
 * Input Parameters:
 *   peripheral - The peripheral to ensable in deep sleep mode. This is an
 *                encoded value.  See the PRCRM_PERIPH_* definitions for
 *                available encodings.
 *
 ******************************************************************************/

void prcm_periph_deepsleepenable(uint32_t peripheral)
{
  unsigned int index;

  /* Extract the index */

  index = PRCM_PERIPH_INDEX(peripheral);
  DEBUGASSERT(index < TABLE_SIZE);

  /* Enable this peripheral in sleep mode. */

  modifyreg32(g_dcgcr_base[index], PRCM_PERIPH_MASKBIT(peripheral), 0);
}

/******************************************************************************
 * Name: prcm_periph_deepsleepdisable
 *
 * Description:
 *   Disables a peripheral in deep-sleep mode
 *
 *   This function causes a peripheral to stop operating when the processor goes
 *   into deep-sleep mode.  Disabling peripherals while in deep-sleep mode helps
 *   to lower the current draw of the device, and can keep peripherals that
 *   require a particular clock frequency from operating when the clock changes
 *   as a result of entering deep-sleep mode.  If enabled (via
 *   prcm_periph_runenable()), the peripheral will automatically resume
 *   operation when the processor leaves deep-sleep mode, maintaining its entire
 *   state from before deep-sleep mode was entered.
 *
 *   NOTE: A call to this function will only setup the shadow registers in the
 *   MCU domain for the PRCM module. For the changes to propagate to the system
 *   controller in the AON domain a call to this function should always be
 *   followed by a call to prcm_load_set().
 *
 * Input Parameters:
 *   peripheral - The peripheral to disable in deep sleep mode. This is an
 *                encoded value.  See the PRCRM_PERIPH_* definitions for
 *                available encodings.
 *
 ******************************************************************************/

void prcm_periph_deepsleepdisable(uint32_t peripheral)
{
  unsigned int index;

  /* Extract the index */

  index = PRCM_PERIPH_INDEX(peripheral);
  DEBUGASSERT(index < TABLE_SIZE);

  /* Enable this peripheral in sleep mode. */

  modifyreg32(g_dcgcr_base[index], 0, PRCM_PERIPH_MASKBIT(peripheral));
}
